MENU_DATABASE = {
    # --- แถวที่ 1 ---
    "ty": {'row': 1, 'col': 1},
    "test00001":    {'row': 1, 'col': 2},
    "ยำปลาป๋อง":     {'row': 1, 'col': 3},
    "ม้านินมังกร":      {'row': 1, 'col': 4},
    # --- แถวที่ 2 ---
    "a ri ka to":    {'row': 2, 'col': 1},
    "bosss":         {'row': 2, 'col': 2},
    "เมนู 3,1":      {'row': 2, 'col': 3},
    "กุ้งหัวแก้ว":     {'row': 2, 'col': 4},
    # --- แถวที่ 3 ---
    "Look-Yee Thai": {'row': 3, 'col': 1},
    "ครัวของดี":      {'row': 3, 'col': 2},
    "testt":         {'row': 3, 'col': 3},
    "ไม่เจียวปู":     {'row': 3, 'col': 4},
    # --- แถวที่ 4 ---
    "แกงส้มชะอมไข่":  {'row': 4, 'col': 1},
    "ผัดไทยกุ้งสด":   {'row': 4, 'col': 2},
    "หมูสะเต๊ะ":      {'row': 4, 'col': 3},
    "ต้มยำกุ้ง":      {'row': 4, 'col': 4},
    # --- แถวที่ 5 ---
    "ปอเปี๊ยะทอด":     {'row': 5, 'col': 1},
    "ทอดมันปลากราย":   {'row': 5, 'col': 2},
    "ไก่ผัดเม็ดมะม่วง": {'row': 5, 'col': 3},
    "ปลากะพงทอดน้ำปลา":{'row': 5, 'col': 4},
    # --- เพิ่มเมนูอื่นๆ ทั้งหมดของร้านต่อที่นี่ ---
}
